/*
    - 다음 연산 결과를 나타내라.
    - 14 % 5            (7) 형으로, 값은 (8) 이다.
    - 14 / 5            (9) 형으로, 값은 (10) 이다.
    - 14 / 5.6          (11) 형으로, 값은 (12) 이다.
    - 14.0 / 5          (13) 형으로, 값은 (14) 이다.
    - 14.0 / 5.6        (15) 형으로, 값은 (16) 이다.
    - (double)14 / 5    (17) 형으로, 값은 (18) 이다.
    - (double)(14 / 5)  (19) 형으로, 값은 (20) 이다.
    - (int)(14.0 / 5)   (21) 형으로, 값은 (23) 이다.
    - (int)14.0 / 5     (23) 형으로, 값은 (24) 이다.
    - (7): int
    - (8): 4
    - (9): int
    - (10): 2
    - (11): double
    - (12): 2.5
    - (13): double
    - (14): 2.8
    - (15): double
    - (16): 2.5
    - (17): double
    - (18): 2.8
    - (19): double
    - (20): 2
    - (21): int
    - (22): 2
    - (23): int
    - (24): 2
*/


#include <stdio.h>


int main(void) {
    return 0;
}