/*
    - max2(1, 3) 은 앞서 본 max2 를 호출하는 식이다.
    - 여기서 사용한 연산 () 의 이름은 (1) 연산자다. 또한 함수에 대해 보조적인 지시를 주기 위한 1 이나 3은 (2) 라고 한다.
    - 함수를 호출하면 프로그램의 흐름은 그 함수로 이동한다.
    - 호출한 함수 max2 의 가인수 a 와 b 에는 (3) 의 값이 대입된다. 이와 같이 전달받는 메커니즘을 (4) 이라고 한다.
    - 함수 max2 는 전달받은 2개의 정숫값 중 큰 쪽의 값을 구해 호출한 곳으로 반환한다. 호출한 곳에 반환할 값의 자료형을 지시하는 것이 위에서 본 (5) 이다. 값을 반환하지 않은 함수의 (6) 은 (7) 라고 선언한다.
    - 2개 이상의 값을 한 번에 반환할 수 (8). 또한 함수가 반환할 값은 함수를 호출한 식을 평가해서 얻을 수 있다.
    - max2(1, 3) 을 평가해 얻을 수 있는 것의 자료형은 (9) 이고 값은 (10) 이다.
    - (1): 함수 호출 연산자 (function call operator)
    - (2): 실인수(argument)
    - (3): 실인수(argument)
    - (4): 값 전달
    - (5): 반환형
    - (6): 반환형
    - (7): void
    - (8): 없다
    - (9): int
    - (10): 3
*/


#include <stdio.h>


int main(void) {
    return 0;
}