/*
    - 다음 표의 공란을 채워라.
    - 논리곱
        - a           b         a && b
        - 0이아님       0이아님      (1)
        - 0이아님       0          (2)
        - 0           0이아님      (3)
        - 0           0          (4)
    - 논리곱
        - a           b         a || b
        - 0이아님       0이아님      (5)
        - 0이아님       0          (6)
        - 0           0이아님      (7)
        - 0           0          (8)
    - (1): 1
    - (2): 0
    - (3): 0
    - (4): 0
    - (5): 0
    - (6): 1
    - (7): 1
    - (8): 1
    - (9): 0
*/


#include <stdio.h>


int main(void) {
    return 0;
}