/*
    - int 형 변수 n1, n2, n3, n4 의 값이 각각 15, 15, 20, 30 이라고 했을 때, 다음 각 식을 평가한 값을 나타내라.
        - n1 == n2
            = 1
        - n1 == n3
            - 0
        - n1 != n2
            - 0
        - n1 != n4
            - 1
        - n1 >= n2
            - 1
        - n1 > n2
            - 0
        - n2 <= n3
            - 1
        - n2 < n4
            - 1
        - n1 % 5 == 0
            - 1
        - n1 / 5 != 3
            - 0
        - n1 ? n2 : n3
            - 15
        - n1 != n2 ? 5 : 3
            - 3
        - 1 && 0
            - 0
        - 1 || 0
            - 1
        - 1 && 1
            - 1
        - 1 || 1
            - 1
        - n1 && n2
            - 1
        - n1 || n2
            - 1
        - (n1 == n2) && 0
            - 0
        - (n1 == n2) || 0
            - 1

*/


#include <stdio.h>


int main(void) {
    return 0;
}